//Од тастатура се читаат непознат број на позитивни цели броеви (со максимум 5 цифри)
// се додека не се внесе нешто различно од број. За секој број
// треба да се најде позицијата (од десно на лево) на првото
// појавување на најголемата цифра во составот на бројот
// (цифрата на единици се наоѓа на позиција 0). Потоа, да се испечати статистика
// за позициите на најдените цифри со максимална вредност во следниот формат:
//
//[позиција]: [вкупно броеви чија максимална цифра се наоѓа на таа позиција]
//
//0: 2
//
//1: 3
//
//2: 1
//
//3: 1
//
//4: 1
//
//за броевите 97654 48654 12345 12343 1263 12443 12643 12777
#include <iostream>
using namespace std;

int main(){
    int num;
    int pos0 = 0, pos1 = 0, pos2 = 0, pos3 = 0, pos4 = 0;
    while(cin>>num){
        int cpy = num;
        int maxpos = 0;
        int max = cpy%10;
        int i = 0;
        for(; cpy != 0; i++, cpy/=10){
            if(cpy%10 > max){
                maxpos = i;
                max = cpy%10;
            }
        }
        switch(maxpos){
            case 0:
                pos0++;
                break;
            case 1:
                pos1++;
                break;
            case 2:
                pos2++;
                break;
            case 3:
                pos3++;
                break;
            case 4:
                pos4++;
                break;
            default:
                break;
        }
    }
//    97654 48654 12345 12343 1263 12443 12643 12777 #
    cout<<"0: "<<pos0<<endl;
    cout<<"1: "<<pos1<<endl;
    cout<<"2: "<<pos2<<endl;
    cout<<"3: "<<pos3<<endl;
    cout<<"4: "<<pos4<<endl;
}
